# St7GetResultCaseStage

Returns the stage associated with the specified result case in the result file currently open.

long St7GetResultCaseStage(long uID, long CaseNum, long* Stage)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Result case number.

Output Parameters

Stage

Stage index.

Applicability

Applicable to all solver types.

Strand7 API Manual